## Plan Result (mgmt-dns)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_dns_cname_record.this[&#34;incidents&#34;]
  * azurerm_role_assignment.vault_access




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_dns_cname_record.this["incidents"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "incidents"
      + record              = "incidents-cjscommonplatform.msappproxy.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hmcts.net"
    }

  # azurerm_role_assignment.vault_access will be created
  + resource "azurerm_role_assignment" "vault_access" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "626041d7-1bf3-46ca-84b6-28b6b0c60efe"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-ptl-rg/providers/Microsoft.KeyVault/vaults/acmedtscftptlintsvc"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":4,"Program":"tfcmt","SHA1":"","Target":"mgmt-dns","Vars":{}} -->